{
  "token2id": {
    "<PAD>": 0,
    "<BOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "<ROLE_MELODY>": 4,
    "<ROLE_BASS>": 5,
    "<ROLE_CHORDS>": 6,
    "<GENRE_CLASSICAL>": 7,
    "<GENRE_TRAP>": 8,
    "NOTE_OFF_0x0e": 9,
    "NOTE_OFF_0x11": 10,
    "NOTE_OFF_0x12": 11,
    "NOTE_OFF_0x13": 12,
    "NOTE_OFF_0x14": 13,
    "NOTE_OFF_0x15": 14,
    "NOTE_OFF_0x16": 15,
    "NOTE_OFF_0x17": 16,
    "NOTE_OFF_0x18": 17,
    "NOTE_OFF_0x19": 18,
    "NOTE_OFF_0x1a": 19,
    "NOTE_OFF_0x1b": 20,
    "NOTE_OFF_0x1c": 21,
    "NOTE_OFF_0x1d": 22,
    "NOTE_OFF_0x1e": 23,
    "NOTE_OFF_0x1f": 24,
    "NOTE_OFF_0x20": 25,
    "NOTE_OFF_0x21": 26,
    "NOTE_OFF_0x22": 27,
    "NOTE_OFF_0x23": 28,
    "NOTE_OFF_0x24": 29,
    "NOTE_OFF_0x25": 30,
    "NOTE_OFF_0x26": 31,
    "NOTE_OFF_0x27": 32,
    "NOTE_OFF_0x28": 33,
    "NOTE_OFF_0x29": 34,
    "NOTE_OFF_0x2a": 35,
    "NOTE_OFF_0x2b": 36,
    "NOTE_OFF_0x2c": 37,
    "NOTE_OFF_0x2d": 38,
    "NOTE_OFF_0x2e": 39,
    "NOTE_OFF_0x2f": 40,
    "NOTE_OFF_0x30": 41,
    "NOTE_OFF_0x31": 42,
    "NOTE_OFF_0x32": 43,
    "NOTE_OFF_0x33": 44,
    "NOTE_OFF_0x34": 45,
    "NOTE_OFF_0x35": 46,
    "NOTE_OFF_0x36": 47,
    "NOTE_OFF_0x37": 48,
    "NOTE_OFF_0x38": 49,
    "NOTE_OFF_0x39": 50,
    "NOTE_OFF_0x3a": 51,
    "NOTE_OFF_0x3b": 52,
    "NOTE_OFF_0x3c": 53,
    "NOTE_OFF_0x3d": 54,
    "NOTE_OFF_0x3e": 55,
    "NOTE_OFF_0x3f": 56,
    "NOTE_OFF_0x40": 57,
    "NOTE_OFF_0x41": 58,
    "NOTE_OFF_0x42": 59,
    "NOTE_OFF_0x43": 60,
    "NOTE_OFF_0x44": 61,
    "NOTE_OFF_0x45": 62,
    "NOTE_OFF_0x46": 63,
    "NOTE_OFF_0x47": 64,
    "NOTE_OFF_0x48": 65,
    "NOTE_OFF_0x49": 66,
    "NOTE_OFF_0x4a": 67,
    "NOTE_OFF_0x4b": 68,
    "NOTE_OFF_0x4c": 69,
    "NOTE_OFF_0x4d": 70,
    "NOTE_OFF_0x4e": 71,
    "NOTE_OFF_0x4f": 72,
    "NOTE_OFF_0x50": 73,
    "NOTE_OFF_0x51": 74,
    "NOTE_OFF_0x52": 75,
    "NOTE_OFF_0x53": 76,
    "NOTE_OFF_0x54": 77,
    "NOTE_OFF_0x55": 78,
    "NOTE_OFF_0x56": 79,
    "NOTE_OFF_0x57": 80,
    "NOTE_OFF_0x58": 81,
    "NOTE_OFF_0x59": 82,
    "NOTE_OFF_0x5a": 83,
    "NOTE_OFF_0x5b": 84,
    "NOTE_OFF_0x5c": 85,
    "NOTE_OFF_0x5d": 86,
    "NOTE_OFF_0x5e": 87,
    "NOTE_OFF_0x5f": 88,
    "NOTE_OFF_0x60": 89,
    "NOTE_OFF_0x61": 90,
    "NOTE_OFF_0x62": 91,
    "NOTE_OFF_0x63": 92,
    "NOTE_OFF_0x64": 93,
    "NOTE_OFF_0x65": 94,
    "NOTE_OFF_0x66": 95,
    "NOTE_OFF_0x67": 96,
    "NOTE_OFF_0x68": 97,
    "NOTE_OFF_0x69": 98,
    "NOTE_OFF_0x6a": 99,
    "NOTE_OFF_0x6b": 100,
    "NOTE_OFF_0x6c": 101,
    "NOTE_OFF_0x6d": 102,
    "NOTE_OFF_0x6e": 103,
    "NOTE_OFF_0x6f": 104,
    "NOTE_OFF_0x70": 105,
    "NOTE_OFF_0x71": 106,
    "NOTE_OFF_0x72": 107,
    "NOTE_OFF_0x73": 108,
    "NOTE_OFF_0x74": 109,
    "NOTE_OFF_0x76": 110,
    "NOTE_OFF_0x7f": 111,
    "NOTE_ON_0x0e": 112,
    "NOTE_ON_0x11": 113,
    "NOTE_ON_0x12": 114,
    "NOTE_ON_0x13": 115,
    "NOTE_ON_0x14": 116,
    "NOTE_ON_0x15": 117,
    "NOTE_ON_0x16": 118,
    "NOTE_ON_0x17": 119,
    "NOTE_ON_0x18": 120,
    "NOTE_ON_0x19": 121,
    "NOTE_ON_0x1a": 122,
    "NOTE_ON_0x1b": 123,
    "NOTE_ON_0x1c": 124,
    "NOTE_ON_0x1d": 125,
    "NOTE_ON_0x1e": 126,
    "NOTE_ON_0x1f": 127,
    "NOTE_ON_0x20": 128,
    "NOTE_ON_0x21": 129,
    "NOTE_ON_0x22": 130,
    "NOTE_ON_0x23": 131,
    "NOTE_ON_0x24": 132,
    "NOTE_ON_0x25": 133,
    "NOTE_ON_0x26": 134,
    "NOTE_ON_0x27": 135,
    "NOTE_ON_0x28": 136,
    "NOTE_ON_0x29": 137,
    "NOTE_ON_0x2a": 138,
    "NOTE_ON_0x2b": 139,
    "NOTE_ON_0x2c": 140,
    "NOTE_ON_0x2d": 141,
    "NOTE_ON_0x2e": 142,
    "NOTE_ON_0x2f": 143,
    "NOTE_ON_0x30": 144,
    "NOTE_ON_0x31": 145,
    "NOTE_ON_0x32": 146,
    "NOTE_ON_0x33": 147,
    "NOTE_ON_0x34": 148,
    "NOTE_ON_0x35": 149,
    "NOTE_ON_0x36": 150,
    "NOTE_ON_0x37": 151,
    "NOTE_ON_0x38": 152,
    "NOTE_ON_0x39": 153,
    "NOTE_ON_0x3a": 154,
    "NOTE_ON_0x3b": 155,
    "NOTE_ON_0x3c": 156,
    "NOTE_ON_0x3d": 157,
    "NOTE_ON_0x3e": 158,
    "NOTE_ON_0x3f": 159,
    "NOTE_ON_0x40": 160,
    "NOTE_ON_0x41": 161,
    "NOTE_ON_0x42": 162,
    "NOTE_ON_0x43": 163,
    "NOTE_ON_0x44": 164,
    "NOTE_ON_0x45": 165,
    "NOTE_ON_0x46": 166,
    "NOTE_ON_0x47": 167,
    "NOTE_ON_0x48": 168,
    "NOTE_ON_0x49": 169,
    "NOTE_ON_0x4a": 170,
    "NOTE_ON_0x4b": 171,
    "NOTE_ON_0x4c": 172,
    "NOTE_ON_0x4d": 173,
    "NOTE_ON_0x4e": 174,
    "NOTE_ON_0x4f": 175,
    "NOTE_ON_0x50": 176,
    "NOTE_ON_0x51": 177,
    "NOTE_ON_0x52": 178,
    "NOTE_ON_0x53": 179,
    "NOTE_ON_0x54": 180,
    "NOTE_ON_0x55": 181,
    "NOTE_ON_0x56": 182,
    "NOTE_ON_0x57": 183,
    "NOTE_ON_0x58": 184,
    "NOTE_ON_0x59": 185,
    "NOTE_ON_0x5a": 186,
    "NOTE_ON_0x5b": 187,
    "NOTE_ON_0x5c": 188,
    "NOTE_ON_0x5d": 189,
    "NOTE_ON_0x5e": 190,
    "NOTE_ON_0x5f": 191,
    "NOTE_ON_0x60": 192,
    "NOTE_ON_0x61": 193,
    "NOTE_ON_0x62": 194,
    "NOTE_ON_0x63": 195,
    "NOTE_ON_0x64": 196,
    "NOTE_ON_0x65": 197,
    "NOTE_ON_0x66": 198,
    "NOTE_ON_0x67": 199,
    "NOTE_ON_0x68": 200,
    "NOTE_ON_0x69": 201,
    "NOTE_ON_0x6a": 202,
    "NOTE_ON_0x6b": 203,
    "NOTE_ON_0x6c": 204,
    "NOTE_ON_0x6d": 205,
    "NOTE_ON_0x6e": 206,
    "NOTE_ON_0x6f": 207,
    "NOTE_ON_0x70": 208,
    "NOTE_ON_0x71": 209,
    "NOTE_ON_0x72": 210,
    "NOTE_ON_0x73": 211,
    "NOTE_ON_0x74": 212,
    "NOTE_ON_0x76": 213,
    "NOTE_ON_0x7f": 214,
    "TIME_SHIFT_0x0001": 215,
    "TIME_SHIFT_0x0002": 216,
    "TIME_SHIFT_0x0003": 217,
    "TIME_SHIFT_0x0005": 218,
    "TIME_SHIFT_0x0007": 219,
    "TIME_SHIFT_0x0008": 220,
    "TIME_SHIFT_0x000a": 221,
    "TIME_SHIFT_0x000c": 222,
    "TIME_SHIFT_0x000d": 223,
    "TIME_SHIFT_0x000f": 224,
    "TIME_SHIFT_0x0011": 225,
    "TIME_SHIFT_0x0012": 226,
    "TIME_SHIFT_0x0014": 227,
    "TIME_SHIFT_0x0016": 228,
    "TIME_SHIFT_0x0017": 229,
    "TIME_SHIFT_0x0019": 230,
    "TIME_SHIFT_0x001b": 231,
    "TIME_SHIFT_0x001c": 232,
    "TIME_SHIFT_0x001e": 233,
    "TIME_SHIFT_0x0020": 234,
    "TIME_SHIFT_0x0021": 235,
    "TIME_SHIFT_0x0023": 236,
    "TIME_SHIFT_0x0025": 237,
    "TIME_SHIFT_0x0026": 238,
    "TIME_SHIFT_0x0028": 239,
    "TIME_SHIFT_0x002a": 240,
    "TIME_SHIFT_0x002b": 241,
    "TIME_SHIFT_0x002d": 242,
    "TIME_SHIFT_0x002f": 243,
    "TIME_SHIFT_0x0030": 244,
    "TIME_SHIFT_0x0032": 245,
    "TIME_SHIFT_0x0034": 246,
    "TIME_SHIFT_0x0035": 247,
    "TIME_SHIFT_0x0037": 248,
    "TIME_SHIFT_0x0039": 249,
    "TIME_SHIFT_0x003a": 250,
    "TIME_SHIFT_0x003c": 251,
    "TIME_SHIFT_0x003e": 252,
    "TIME_SHIFT_0x003f": 253,
    "TIME_SHIFT_0x0041": 254,
    "TIME_SHIFT_0x0043": 255,
    "TIME_SHIFT_0x0044": 256,
    "TIME_SHIFT_0x0046": 257,
    "TIME_SHIFT_0x0048": 258,
    "TIME_SHIFT_0x0049": 259,
    "TIME_SHIFT_0x004b": 260,
    "TIME_SHIFT_0x004d": 261,
    "TIME_SHIFT_0x004e": 262,
    "TIME_SHIFT_0x0050": 263,
    "TIME_SHIFT_0x0052": 264,
    "TIME_SHIFT_0x0053": 265,
    "TIME_SHIFT_0x0055": 266,
    "TIME_SHIFT_0x0057": 267,
    "TIME_SHIFT_0x0058": 268,
    "TIME_SHIFT_0x005a": 269,
    "TIME_SHIFT_0x005c": 270,
    "TIME_SHIFT_0x005d": 271,
    "TIME_SHIFT_0x005f": 272,
    "TIME_SHIFT_0x0061": 273,
    "TIME_SHIFT_0x0062": 274,
    "TIME_SHIFT_0x0064": 275,
    "TIME_SHIFT_0x0066": 276,
    "TIME_SHIFT_0x0067": 277,
    "TIME_SHIFT_0x0069": 278,
    "TIME_SHIFT_0x006b": 279,
    "TIME_SHIFT_0x006c": 280,
    "TIME_SHIFT_0x006e": 281,
    "TIME_SHIFT_0x0070": 282,
    "TIME_SHIFT_0x0071": 283,
    "TIME_SHIFT_0x0073": 284,
    "TIME_SHIFT_0x0075": 285,
    "TIME_SHIFT_0x0076": 286,
    "TIME_SHIFT_0x0078": 287,
    "TIME_SHIFT_0x007a": 288,
    "TIME_SHIFT_0x007b": 289,
    "TIME_SHIFT_0x007d": 290,
    "TIME_SHIFT_0x007f": 291,
    "TIME_SHIFT_0x0080": 292,
    "TIME_SHIFT_0x0082": 293,
    "TIME_SHIFT_0x0084": 294,
    "TIME_SHIFT_0x0085": 295,
    "TIME_SHIFT_0x0087": 296,
    "TIME_SHIFT_0x0089": 297,
    "TIME_SHIFT_0x008a": 298,
    "TIME_SHIFT_0x008c": 299,
    "TIME_SHIFT_0x008e": 300,
    "TIME_SHIFT_0x008f": 301,
    "TIME_SHIFT_0x0091": 302,
    "TIME_SHIFT_0x0093": 303,
    "TIME_SHIFT_0x0094": 304,
    "TIME_SHIFT_0x0096": 305,
    "TIME_SHIFT_0x0098": 306,
    "TIME_SHIFT_0x0099": 307,
    "TIME_SHIFT_0x009b": 308,
    "TIME_SHIFT_0x009d": 309,
    "TIME_SHIFT_0x009e": 310,
    "TIME_SHIFT_0x00a0": 311,
    "TIME_SHIFT_0x00a2": 312,
    "TIME_SHIFT_0x00a3": 313,
    "TIME_SHIFT_0x00a5": 314,
    "TIME_SHIFT_0x00a7": 315,
    "TIME_SHIFT_0x00a8": 316,
    "TIME_SHIFT_0x00aa": 317,
    "TIME_SHIFT_0x00ac": 318,
    "TIME_SHIFT_0x00ad": 319,
    "TIME_SHIFT_0x00af": 320,
    "TIME_SHIFT_0x00b1": 321,
    "TIME_SHIFT_0x00b2": 322,
    "TIME_SHIFT_0x00b4": 323,
    "TIME_SHIFT_0x00b6": 324,
    "TIME_SHIFT_0x00b7": 325,
    "TIME_SHIFT_0x00b9": 326,
    "TIME_SHIFT_0x00bb": 327,
    "TIME_SHIFT_0x00bc": 328,
    "TIME_SHIFT_0x00be": 329,
    "TIME_SHIFT_0x00c0": 330,
    "TIME_SHIFT_0x00c1": 331,
    "TIME_SHIFT_0x00c3": 332,
    "TIME_SHIFT_0x00c5": 333,
    "TIME_SHIFT_0x00c6": 334,
    "TIME_SHIFT_0x00c8": 335,
    "TIME_SHIFT_0x00ca": 336,
    "TIME_SHIFT_0x00cb": 337,
    "TIME_SHIFT_0x00cd": 338,
    "TIME_SHIFT_0x00cf": 339,
    "TIME_SHIFT_0x00d0": 340,
    "TIME_SHIFT_0x00d2": 341,
    "TIME_SHIFT_0x00d4": 342,
    "TIME_SHIFT_0x00d5": 343,
    "TIME_SHIFT_0x00d7": 344,
    "TIME_SHIFT_0x00d9": 345,
    "TIME_SHIFT_0x00da": 346,
    "TIME_SHIFT_0x00dc": 347,
    "TIME_SHIFT_0x00de": 348,
    "TIME_SHIFT_0x00df": 349,
    "TIME_SHIFT_0x00e1": 350,
    "TIME_SHIFT_0x00e3": 351,
    "TIME_SHIFT_0x00e4": 352,
    "TIME_SHIFT_0x00e6": 353,
    "TIME_SHIFT_0x00e8": 354,
    "TIME_SHIFT_0x00e9": 355,
    "TIME_SHIFT_0x00eb": 356,
    "TIME_SHIFT_0x00ed": 357,
    "TIME_SHIFT_0x00ee": 358,
    "TIME_SHIFT_0x00f0": 359,
    "TIME_SHIFT_0x00f2": 360,
    "TIME_SHIFT_0x00f3": 361,
    "TIME_SHIFT_0x00f5": 362,
    "TIME_SHIFT_0x00f7": 363,
    "TIME_SHIFT_0x00f8": 364,
    "TIME_SHIFT_0x00fa": 365,
    "TIME_SHIFT_0x00fc": 366,
    "TIME_SHIFT_0x00fd": 367,
    "TIME_SHIFT_0x00ff": 368,
    "TIME_SHIFT_0x0101": 369,
    "TIME_SHIFT_0x0102": 370,
    "TIME_SHIFT_0x0104": 371,
    "TIME_SHIFT_0x0106": 372,
    "TIME_SHIFT_0x0107": 373,
    "TIME_SHIFT_0x0109": 374,
    "TIME_SHIFT_0x010b": 375,
    "TIME_SHIFT_0x010c": 376,
    "TIME_SHIFT_0x010e": 377,
    "TIME_SHIFT_0x0110": 378,
    "TIME_SHIFT_0x0111": 379,
    "TIME_SHIFT_0x0113": 380,
    "TIME_SHIFT_0x0115": 381,
    "TIME_SHIFT_0x0116": 382,
    "TIME_SHIFT_0x0118": 383,
    "TIME_SHIFT_0x011a": 384,
    "TIME_SHIFT_0x011b": 385,
    "TIME_SHIFT_0x011d": 386,
    "TIME_SHIFT_0x011f": 387,
    "TIME_SHIFT_0x0120": 388,
    "TIME_SHIFT_0x0122": 389,
    "TIME_SHIFT_0x0124": 390,
    "TIME_SHIFT_0x0125": 391,
    "TIME_SHIFT_0x0127": 392,
    "TIME_SHIFT_0x0129": 393,
    "TIME_SHIFT_0x012a": 394,
    "TIME_SHIFT_0x012c": 395,
    "TIME_SHIFT_0x012e": 396,
    "TIME_SHIFT_0x012f": 397,
    "TIME_SHIFT_0x0131": 398,
    "TIME_SHIFT_0x0133": 399,
    "TIME_SHIFT_0x0134": 400,
    "TIME_SHIFT_0x0136": 401,
    "TIME_SHIFT_0x0138": 402,
    "TIME_SHIFT_0x0139": 403,
    "TIME_SHIFT_0x013b": 404,
    "TIME_SHIFT_0x013d": 405,
    "TIME_SHIFT_0x013e": 406,
    "TIME_SHIFT_0x0140": 407,
    "TIME_SHIFT_0x0142": 408,
    "TIME_SHIFT_0x0143": 409,
    "TIME_SHIFT_0x0145": 410,
    "TIME_SHIFT_0x0147": 411,
    "TIME_SHIFT_0x0148": 412,
    "TIME_SHIFT_0x014a": 413,
    "TIME_SHIFT_0x014c": 414,
    "TIME_SHIFT_0x014d": 415,
    "TIME_SHIFT_0x014f": 416,
    "TIME_SHIFT_0x0151": 417,
    "TIME_SHIFT_0x0152": 418,
    "TIME_SHIFT_0x0154": 419,
    "TIME_SHIFT_0x0156": 420,
    "TIME_SHIFT_0x0157": 421,
    "TIME_SHIFT_0x0159": 422,
    "TIME_SHIFT_0x015b": 423,
    "TIME_SHIFT_0x015c": 424,
    "TIME_SHIFT_0x015e": 425,
    "TIME_SHIFT_0x0160": 426,
    "TIME_SHIFT_0x0161": 427,
    "TIME_SHIFT_0x0163": 428,
    "TIME_SHIFT_0x0165": 429,
    "TIME_SHIFT_0x0166": 430,
    "TIME_SHIFT_0x0168": 431,
    "TIME_SHIFT_0x016a": 432,
    "TIME_SHIFT_0x016b": 433,
    "TIME_SHIFT_0x016d": 434,
    "TIME_SHIFT_0x016f": 435,
    "TIME_SHIFT_0x0170": 436,
    "TIME_SHIFT_0x0172": 437,
    "TIME_SHIFT_0x0174": 438,
    "TIME_SHIFT_0x0175": 439,
    "TIME_SHIFT_0x0177": 440,
    "TIME_SHIFT_0x0179": 441,
    "TIME_SHIFT_0x017a": 442,
    "TIME_SHIFT_0x017c": 443,
    "TIME_SHIFT_0x017e": 444,
    "TIME_SHIFT_0x017f": 445,
    "TIME_SHIFT_0x0181": 446,
    "TIME_SHIFT_0x0183": 447,
    "TIME_SHIFT_0x0184": 448,
    "TIME_SHIFT_0x0186": 449,
    "TIME_SHIFT_0x0188": 450,
    "TIME_SHIFT_0x0189": 451,
    "TIME_SHIFT_0x018b": 452,
    "TIME_SHIFT_0x018d": 453,
    "TIME_SHIFT_0x018e": 454,
    "TIME_SHIFT_0x0190": 455,
    "TIME_SHIFT_0x0192": 456,
    "TIME_SHIFT_0x0193": 457,
    "TIME_SHIFT_0x0195": 458,
    "TIME_SHIFT_0x0197": 459,
    "TIME_SHIFT_0x0198": 460,
    "TIME_SHIFT_0x019a": 461,
    "TIME_SHIFT_0x019c": 462,
    "TIME_SHIFT_0x019d": 463,
    "TIME_SHIFT_0x019f": 464,
    "TIME_SHIFT_0x01a1": 465,
    "TIME_SHIFT_0x01a2": 466,
    "TIME_SHIFT_0x01a4": 467,
    "TIME_SHIFT_0x01a6": 468,
    "TIME_SHIFT_0x01a7": 469,
    "TIME_SHIFT_0x01a9": 470,
    "TIME_SHIFT_0x01ab": 471,
    "TIME_SHIFT_0x01ac": 472,
    "TIME_SHIFT_0x01ae": 473,
    "TIME_SHIFT_0x01b0": 474,
    "TIME_SHIFT_0x01b1": 475,
    "TIME_SHIFT_0x01b3": 476,
    "TIME_SHIFT_0x01b5": 477,
    "TIME_SHIFT_0x01b6": 478,
    "TIME_SHIFT_0x01b8": 479,
    "TIME_SHIFT_0x01ba": 480,
    "TIME_SHIFT_0x01bb": 481,
    "TIME_SHIFT_0x01bd": 482,
    "TIME_SHIFT_0x01bf": 483,
    "TIME_SHIFT_0x01c0": 484,
    "TIME_SHIFT_0x01c2": 485,
    "TIME_SHIFT_0x01c4": 486,
    "TIME_SHIFT_0x01c5": 487,
    "TIME_SHIFT_0x01c7": 488,
    "TIME_SHIFT_0x01c9": 489,
    "TIME_SHIFT_0x01ca": 490,
    "TIME_SHIFT_0x01cc": 491,
    "TIME_SHIFT_0x01ce": 492,
    "TIME_SHIFT_0x01cf": 493,
    "TIME_SHIFT_0x01d1": 494,
    "TIME_SHIFT_0x01d3": 495,
    "TIME_SHIFT_0x01d4": 496,
    "TIME_SHIFT_0x01d6": 497,
    "TIME_SHIFT_0x01d8": 498,
    "TIME_SHIFT_0x01d9": 499,
    "TIME_SHIFT_0x01db": 500,
    "TIME_SHIFT_0x01dd": 501,
    "TIME_SHIFT_0x01de": 502,
    "TIME_SHIFT_0x01e0": 503,
    "TIME_SHIFT_0x01e2": 504,
    "TIME_SHIFT_0x01e3": 505,
    "TIME_SHIFT_0x01e5": 506,
    "TIME_SHIFT_0x01e7": 507,
    "TIME_SHIFT_0x01e8": 508,
    "TIME_SHIFT_0x01ea": 509,
    "TIME_SHIFT_0x01ec": 510,
    "TIME_SHIFT_0x01ed": 511,
    "TIME_SHIFT_0x01ef": 512,
    "TIME_SHIFT_0x01f1": 513,
    "TIME_SHIFT_0x01f2": 514,
    "TIME_SHIFT_0x01f4": 515,
    "TIME_SHIFT_0x01f6": 516,
    "TIME_SHIFT_0x01f7": 517,
    "TIME_SHIFT_0x01f9": 518,
    "TIME_SHIFT_0x01fb": 519,
    "TIME_SHIFT_0x01fc": 520,
    "TIME_SHIFT_0x01fe": 521,
    "TIME_SHIFT_0x0200": 522,
    "TIME_SHIFT_0x0201": 523,
    "TIME_SHIFT_0x0203": 524,
    "TIME_SHIFT_0x0205": 525,
    "TIME_SHIFT_0x0206": 526,
    "TIME_SHIFT_0x0208": 527,
    "TIME_SHIFT_0x020a": 528,
    "TIME_SHIFT_0x020b": 529,
    "TIME_SHIFT_0x020d": 530,
    "TIME_SHIFT_0x020f": 531,
    "TIME_SHIFT_0x0210": 532,
    "TIME_SHIFT_0x0212": 533,
    "TIME_SHIFT_0x0214": 534,
    "TIME_SHIFT_0x0215": 535,
    "TIME_SHIFT_0x0217": 536,
    "TIME_SHIFT_0x0219": 537,
    "TIME_SHIFT_0x021a": 538,
    "TIME_SHIFT_0x021c": 539,
    "TIME_SHIFT_0x021e": 540,
    "TIME_SHIFT_0x021f": 541,
    "TIME_SHIFT_0x0221": 542,
    "TIME_SHIFT_0x0223": 543,
    "TIME_SHIFT_0x0224": 544,
    "TIME_SHIFT_0x0226": 545,
    "TIME_SHIFT_0x0228": 546,
    "TIME_SHIFT_0x0229": 547,
    "TIME_SHIFT_0x022b": 548,
    "TIME_SHIFT_0x022d": 549,
    "TIME_SHIFT_0x022e": 550,
    "TIME_SHIFT_0x0230": 551,
    "TIME_SHIFT_0x0232": 552,
    "TIME_SHIFT_0x0233": 553,
    "TIME_SHIFT_0x0235": 554,
    "TIME_SHIFT_0x0237": 555,
    "TIME_SHIFT_0x0238": 556,
    "TIME_SHIFT_0x023a": 557,
    "TIME_SHIFT_0x023c": 558,
    "TIME_SHIFT_0x023d": 559,
    "TIME_SHIFT_0x023f": 560,
    "TIME_SHIFT_0x0241": 561,
    "TIME_SHIFT_0x0242": 562,
    "TIME_SHIFT_0x0244": 563,
    "TIME_SHIFT_0x0246": 564,
    "TIME_SHIFT_0x0247": 565,
    "TIME_SHIFT_0x0249": 566,
    "TIME_SHIFT_0x024b": 567,
    "TIME_SHIFT_0x024c": 568,
    "TIME_SHIFT_0x024e": 569,
    "TIME_SHIFT_0x0250": 570,
    "TIME_SHIFT_0x0251": 571,
    "TIME_SHIFT_0x0253": 572,
    "TIME_SHIFT_0x0255": 573,
    "TIME_SHIFT_0x0256": 574,
    "TIME_SHIFT_0x0258": 575,
    "TIME_SHIFT_0x025a": 576,
    "TIME_SHIFT_0x025b": 577,
    "TIME_SHIFT_0x025d": 578,
    "TIME_SHIFT_0x025f": 579,
    "TIME_SHIFT_0x0260": 580,
    "TIME_SHIFT_0x0262": 581,
    "TIME_SHIFT_0x0264": 582,
    "TIME_SHIFT_0x0265": 583,
    "TIME_SHIFT_0x0267": 584,
    "TIME_SHIFT_0x0269": 585,
    "TIME_SHIFT_0x026a": 586,
    "TIME_SHIFT_0x026c": 587,
    "TIME_SHIFT_0x026e": 588,
    "TIME_SHIFT_0x026f": 589,
    "TIME_SHIFT_0x0271": 590,
    "TIME_SHIFT_0x0273": 591,
    "TIME_SHIFT_0x0274": 592,
    "TIME_SHIFT_0x0276": 593,
    "TIME_SHIFT_0x0278": 594,
    "TIME_SHIFT_0x0279": 595,
    "TIME_SHIFT_0x027b": 596,
    "TIME_SHIFT_0x027e": 597,
    "TIME_SHIFT_0x0280": 598,
    "TIME_SHIFT_0x0282": 599,
    "TIME_SHIFT_0x0283": 600,
    "TIME_SHIFT_0x0285": 601,
    "TIME_SHIFT_0x0287": 602,
    "TIME_SHIFT_0x0288": 603,
    "TIME_SHIFT_0x028a": 604,
    "TIME_SHIFT_0x028c": 605,
    "TIME_SHIFT_0x028d": 606,
    "TIME_SHIFT_0x028f": 607,
    "TIME_SHIFT_0x0291": 608,
    "TIME_SHIFT_0x0292": 609,
    "TIME_SHIFT_0x0294": 610,
    "TIME_SHIFT_0x0296": 611,
    "TIME_SHIFT_0x0297": 612,
    "TIME_SHIFT_0x0299": 613,
    "TIME_SHIFT_0x029b": 614,
    "TIME_SHIFT_0x029c": 615,
    "TIME_SHIFT_0x029e": 616,
    "TIME_SHIFT_0x02a0": 617,
    "TIME_SHIFT_0x02a1": 618,
    "TIME_SHIFT_0x02a3": 619,
    "TIME_SHIFT_0x02a5": 620,
    "TIME_SHIFT_0x02a6": 621,
    "TIME_SHIFT_0x02a8": 622,
    "TIME_SHIFT_0x02aa": 623,
    "TIME_SHIFT_0x02ab": 624,
    "TIME_SHIFT_0x02ad": 625,
    "TIME_SHIFT_0x02af": 626,
    "TIME_SHIFT_0x02b0": 627,
    "TIME_SHIFT_0x02b2": 628,
    "TIME_SHIFT_0x02b4": 629,
    "TIME_SHIFT_0x02b5": 630,
    "TIME_SHIFT_0x02b7": 631,
    "TIME_SHIFT_0x02b9": 632,
    "TIME_SHIFT_0x02ba": 633,
    "TIME_SHIFT_0x02bc": 634,
    "TIME_SHIFT_0x02be": 635,
    "TIME_SHIFT_0x02bf": 636,
    "TIME_SHIFT_0x02c1": 637,
    "TIME_SHIFT_0x02c3": 638,
    "TIME_SHIFT_0x02c4": 639,
    "TIME_SHIFT_0x02c6": 640,
    "TIME_SHIFT_0x02c9": 641,
    "TIME_SHIFT_0x02cb": 642,
    "TIME_SHIFT_0x02cd": 643,
    "TIME_SHIFT_0x02ce": 644,
    "TIME_SHIFT_0x02d0": 645,
    "TIME_SHIFT_0x02d2": 646,
    "TIME_SHIFT_0x02d3": 647,
    "TIME_SHIFT_0x02d5": 648,
    "TIME_SHIFT_0x02d7": 649,
    "TIME_SHIFT_0x02d8": 650,
    "TIME_SHIFT_0x02da": 651,
    "TIME_SHIFT_0x02dc": 652,
    "TIME_SHIFT_0x02dd": 653,
    "TIME_SHIFT_0x02df": 654,
    "TIME_SHIFT_0x02e2": 655,
    "TIME_SHIFT_0x02e4": 656,
    "TIME_SHIFT_0x02e6": 657,
    "TIME_SHIFT_0x02e7": 658,
    "TIME_SHIFT_0x02e9": 659,
    "TIME_SHIFT_0x02eb": 660,
    "TIME_SHIFT_0x02ec": 661,
    "TIME_SHIFT_0x02ee": 662,
    "TIME_SHIFT_0x02f1": 663,
    "TIME_SHIFT_0x02f3": 664,
    "TIME_SHIFT_0x02f5": 665,
    "TIME_SHIFT_0x02f6": 666,
    "TIME_SHIFT_0x02f8": 667,
    "TIME_SHIFT_0x02fa": 668,
    "TIME_SHIFT_0x02fb": 669,
    "TIME_SHIFT_0x02fd": 670,
    "TIME_SHIFT_0x0300": 671,
    "TIME_SHIFT_0x0302": 672,
    "TIME_SHIFT_0x0304": 673,
    "TIME_SHIFT_0x0305": 674,
    "TIME_SHIFT_0x0307": 675,
    "TIME_SHIFT_0x0309": 676,
    "TIME_SHIFT_0x030a": 677,
    "TIME_SHIFT_0x030c": 678,
    "TIME_SHIFT_0x030e": 679,
    "TIME_SHIFT_0x030f": 680,
    "TIME_SHIFT_0x0311": 681,
    "TIME_SHIFT_0x0313": 682,
    "TIME_SHIFT_0x0314": 683,
    "TIME_SHIFT_0x0316": 684,
    "TIME_SHIFT_0x0318": 685,
    "TIME_SHIFT_0x0319": 686,
    "TIME_SHIFT_0x031b": 687,
    "TIME_SHIFT_0x031e": 688,
    "TIME_SHIFT_0x0320": 689,
    "TIME_SHIFT_0x0323": 690,
    "TIME_SHIFT_0x0325": 691,
    "TIME_SHIFT_0x0327": 692,
    "TIME_SHIFT_0x032a": 693,
    "TIME_SHIFT_0x032c": 694,
    "TIME_SHIFT_0x032d": 695,
    "TIME_SHIFT_0x032f": 696,
    "TIME_SHIFT_0x0331": 697,
    "TIME_SHIFT_0x0334": 698,
    "TIME_SHIFT_0x0336": 699,
    "TIME_SHIFT_0x0339": 700,
    "TIME_SHIFT_0x033b": 701,
    "TIME_SHIFT_0x033c": 702,
    "TIME_SHIFT_0x033e": 703,
    "TIME_SHIFT_0x0340": 704,
    "TIME_SHIFT_0x0341": 705,
    "TIME_SHIFT_0x0343": 706,
    "TIME_SHIFT_0x0345": 707,
    "TIME_SHIFT_0x0346": 708,
    "TIME_SHIFT_0x0348": 709,
    "TIME_SHIFT_0x034a": 710,
    "TIME_SHIFT_0x034d": 711,
    "TIME_SHIFT_0x034f": 712,
    "TIME_SHIFT_0x0350": 713,
    "TIME_SHIFT_0x0352": 714,
    "TIME_SHIFT_0x0354": 715,
    "TIME_SHIFT_0x0355": 716,
    "TIME_SHIFT_0x0357": 717,
    "TIME_SHIFT_0x0359": 718,
    "TIME_SHIFT_0x035a": 719,
    "TIME_SHIFT_0x035c": 720,
    "TIME_SHIFT_0x035e": 721,
    "TIME_SHIFT_0x035f": 722,
    "TIME_SHIFT_0x0361": 723,
    "TIME_SHIFT_0x0363": 724,
    "TIME_SHIFT_0x0366": 725,
    "TIME_SHIFT_0x0369": 726,
    "TIME_SHIFT_0x036b": 727,
    "TIME_SHIFT_0x036d": 728,
    "TIME_SHIFT_0x036e": 729,
    "TIME_SHIFT_0x0370": 730,
    "TIME_SHIFT_0x0372": 731,
    "TIME_SHIFT_0x0373": 732,
    "TIME_SHIFT_0x0375": 733,
    "TIME_SHIFT_0x0377": 734,
    "TIME_SHIFT_0x0378": 735,
    "TIME_SHIFT_0x037a": 736,
    "TIME_SHIFT_0x037d": 737,
    "TIME_SHIFT_0x037f": 738,
    "TIME_SHIFT_0x0382": 739,
    "TIME_SHIFT_0x0384": 740,
    "TIME_SHIFT_0x0386": 741,
    "TIME_SHIFT_0x0387": 742,
    "TIME_SHIFT_0x0389": 743,
    "TIME_SHIFT_0x038c": 744,
    "TIME_SHIFT_0x038e": 745,
    "TIME_SHIFT_0x0390": 746,
    "TIME_SHIFT_0x0391": 747,
    "TIME_SHIFT_0x0393": 748,
    "TIME_SHIFT_0x0395": 749,
    "TIME_SHIFT_0x0396": 750,
    "TIME_SHIFT_0x0398": 751,
    "TIME_SHIFT_0x039a": 752,
    "TIME_SHIFT_0x039b": 753,
    "TIME_SHIFT_0x039d": 754,
    "TIME_SHIFT_0x03a0": 755,
    "TIME_SHIFT_0x03a2": 756,
    "TIME_SHIFT_0x03a5": 757,
    "TIME_SHIFT_0x03a7": 758,
    "TIME_SHIFT_0x03ac": 759,
    "TIME_SHIFT_0x03ae": 760,
    "TIME_SHIFT_0x03af": 761,
    "TIME_SHIFT_0x03b1": 762,
    "TIME_SHIFT_0x03b3": 763,
    "TIME_SHIFT_0x03b4": 764,
    "TIME_SHIFT_0x03b6": 765,
    "TIME_SHIFT_0x03b8": 766,
    "TIME_SHIFT_0x03b9": 767,
    "TIME_SHIFT_0x03bb": 768,
    "TIME_SHIFT_0x03be": 769,
    "TIME_SHIFT_0x03c0": 770,
    "TIME_SHIFT_0x03c2": 771,
    "TIME_SHIFT_0x03c5": 772,
    "TIME_SHIFT_0x03c7": 773,
    "TIME_SHIFT_0x03ca": 774,
    "TIME_SHIFT_0x03cd": 775,
    "TIME_SHIFT_0x03cf": 776,
    "TIME_SHIFT_0x03d2": 777,
    "TIME_SHIFT_0x03d4": 778,
    "TIME_SHIFT_0x03d6": 779,
    "TIME_SHIFT_0x03d7": 780,
    "TIME_SHIFT_0x03d9": 781,
    "TIME_SHIFT_0x03db": 782,
    "TIME_SHIFT_0x03de": 783,
    "TIME_SHIFT_0x03e3": 784,
    "TIME_SHIFT_0x03e5": 785,
    "TIME_SHIFT_0x03e8": 786,
    "TIME_SHIFT_0x03ed": 787,
    "TIME_SHIFT_0x03ef": 788,
    "TIME_SHIFT_0x03f2": 789,
    "TIME_SHIFT_0x03f5": 790,
    "TIME_SHIFT_0x03f9": 791,
    "TIME_SHIFT_0x03fc": 792,
    "TIME_SHIFT_0x0401": 793,
    "TIME_SHIFT_0x0403": 794,
    "TIME_SHIFT_0x0404": 795,
    "TIME_SHIFT_0x0406": 796,
    "TIME_SHIFT_0x040b": 797,
    "TIME_SHIFT_0x0410": 798,
    "TIME_SHIFT_0x0412": 799,
    "TIME_SHIFT_0x0417": 800,
    "TIME_SHIFT_0x041a": 801,
    "TIME_SHIFT_0x041f": 802,
    "TIME_SHIFT_0x0424": 803,
    "TIME_SHIFT_0x0426": 804,
    "TIME_SHIFT_0x0427": 805,
    "TIME_SHIFT_0x0429": 806,
    "TIME_SHIFT_0x042b": 807,
    "TIME_SHIFT_0x042c": 808,
    "TIME_SHIFT_0x042e": 809,
    "TIME_SHIFT_0x0431": 810,
    "TIME_SHIFT_0x0433": 811,
    "TIME_SHIFT_0x0435": 812,
    "TIME_SHIFT_0x0438": 813,
    "TIME_SHIFT_0x043a": 814,
    "TIME_SHIFT_0x043d": 815,
    "TIME_SHIFT_0x0442": 816,
    "TIME_SHIFT_0x0444": 817,
    "TIME_SHIFT_0x0447": 818,
    "TIME_SHIFT_0x044c": 819,
    "TIME_SHIFT_0x0451": 820,
    "TIME_SHIFT_0x0456": 821,
    "TIME_SHIFT_0x0459": 822,
    "TIME_SHIFT_0x045d": 823,
    "TIME_SHIFT_0x0460": 824,
    "TIME_SHIFT_0x0465": 825,
    "TIME_SHIFT_0x046c": 826,
    "TIME_SHIFT_0x046d": 827,
    "TIME_SHIFT_0x046f": 828,
    "TIME_SHIFT_0x0474": 829,
    "TIME_SHIFT_0x0479": 830,
    "TIME_SHIFT_0x047e": 831,
    "TIME_SHIFT_0x0481": 832,
    "TIME_SHIFT_0x0485": 833,
    "TIME_SHIFT_0x0488": 834,
    "TIME_SHIFT_0x0494": 835,
    "TIME_SHIFT_0x0497": 836,
    "TIME_SHIFT_0x049c": 837,
    "TIME_SHIFT_0x049f": 838,
    "TIME_SHIFT_0x04a1": 839,
    "TIME_SHIFT_0x04a8": 840,
    "TIME_SHIFT_0x04b0": 841,
    "TIME_SHIFT_0x04b5": 842,
    "TIME_SHIFT_0x04b7": 843,
    "TIME_SHIFT_0x04ba": 844,
    "TIME_SHIFT_0x04bd": 845,
    "TIME_SHIFT_0x04c2": 846,
    "TIME_SHIFT_0x04c4": 847,
    "TIME_SHIFT_0x04c9": 848,
    "TIME_SHIFT_0x04d1": 849,
    "TIME_SHIFT_0x04d6": 850,
    "TIME_SHIFT_0x04d8": 851,
    "TIME_SHIFT_0x04e4": 852,
    "TIME_SHIFT_0x04e7": 853,
    "TIME_SHIFT_0x04ec": 854,
    "TIME_SHIFT_0x04f1": 855,
    "TIME_SHIFT_0x04f3": 856,
    "TIME_SHIFT_0x04f4": 857,
    "TIME_SHIFT_0x04f9": 858,
    "TIME_SHIFT_0x0500": 859,
    "TIME_SHIFT_0x050a": 860,
    "TIME_SHIFT_0x0514": 861,
    "TIME_SHIFT_0x0519": 862,
    "TIME_SHIFT_0x051e": 863,
    "TIME_SHIFT_0x0523": 864,
    "TIME_SHIFT_0x0525": 865,
    "TIME_SHIFT_0x0528": 866,
    "TIME_SHIFT_0x052d": 867,
    "TIME_SHIFT_0x0532": 868,
    "TIME_SHIFT_0x0537": 869,
    "TIME_SHIFT_0x0541": 870,
    "TIME_SHIFT_0x0546": 871,
    "TIME_SHIFT_0x054b": 872,
    "TIME_SHIFT_0x054e": 873,
    "TIME_SHIFT_0x0555": 874,
    "TIME_SHIFT_0x055a": 875,
    "TIME_SHIFT_0x055d": 876,
    "TIME_SHIFT_0x0562": 877,
    "TIME_SHIFT_0x0564": 878,
    "TIME_SHIFT_0x0569": 879,
    "TIME_SHIFT_0x056b": 880,
    "TIME_SHIFT_0x056e": 881,
    "TIME_SHIFT_0x0570": 882,
    "TIME_SHIFT_0x0578": 883,
    "TIME_SHIFT_0x0591": 884,
    "TIME_SHIFT_0x0593": 885,
    "TIME_SHIFT_0x0596": 886,
    "TIME_SHIFT_0x059b": 887,
    "TIME_SHIFT_0x05a0": 888,
    "TIME_SHIFT_0x05a7": 889,
    "TIME_SHIFT_0x05af": 890,
    "TIME_SHIFT_0x05b2": 891,
    "TIME_SHIFT_0x05b9": 892,
    "TIME_SHIFT_0x05bb": 893,
    "TIME_SHIFT_0x05be": 894,
    "TIME_SHIFT_0x05c3": 895,
    "TIME_SHIFT_0x05c8": 896,
    "TIME_SHIFT_0x05cd": 897,
    "TIME_SHIFT_0x05d7": 898,
    "TIME_SHIFT_0x05de": 899,
    "TIME_SHIFT_0x05eb": 900,
    "TIME_SHIFT_0x05ed": 901,
    "TIME_SHIFT_0x05f5": 902,
    "TIME_SHIFT_0x0609": 903,
    "TIME_SHIFT_0x060b": 904,
    "TIME_SHIFT_0x060e": 905,
    "TIME_SHIFT_0x0610": 906,
    "TIME_SHIFT_0x0615": 907,
    "TIME_SHIFT_0x0618": 908,
    "TIME_SHIFT_0x061a": 909,
    "TIME_SHIFT_0x0627": 910,
    "TIME_SHIFT_0x0631": 911,
    "TIME_SHIFT_0x063b": 912,
    "TIME_SHIFT_0x0640": 913,
    "TIME_SHIFT_0x0648": 914,
    "TIME_SHIFT_0x064a": 915,
    "TIME_SHIFT_0x065b": 916,
    "TIME_SHIFT_0x0683": 917,
    "TIME_SHIFT_0x0689": 918,
    "TIME_SHIFT_0x068d": 919,
    "TIME_SHIFT_0x0690": 920,
    "TIME_SHIFT_0x0695": 921,
    "TIME_SHIFT_0x069f": 922,
    "TIME_SHIFT_0x06a4": 923,
    "TIME_SHIFT_0x06ae": 924,
    "TIME_SHIFT_0x06b3": 925,
    "TIME_SHIFT_0x06b8": 926,
    "TIME_SHIFT_0x06bd": 927,
    "TIME_SHIFT_0x06bf": 928,
    "TIME_SHIFT_0x06cc": 929,
    "TIME_SHIFT_0x06d1": 930,
    "TIME_SHIFT_0x06db": 931,
    "TIME_SHIFT_0x06e0": 932,
    "TIME_SHIFT_0x06e5": 933,
    "TIME_SHIFT_0x06ec": 934,
    "TIME_SHIFT_0x06ed": 935,
    "TIME_SHIFT_0x06f2": 936,
    "TIME_SHIFT_0x0708": 937,
    "TIME_SHIFT_0x0717": 938,
    "TIME_SHIFT_0x0751": 939,
    "TIME_SHIFT_0x0760": 940,
    "TIME_SHIFT_0x078f": 941,
    "TIME_SHIFT_0x079e": 942,
    "TIME_SHIFT_0x07ad": 943,
    "TIME_SHIFT_0x07b7": 944,
    "TIME_SHIFT_0x07d0": 945,
    "TIME_SHIFT_0x07e9": 946,
    "TIME_SHIFT_0x07f8": 947,
    "TIME_SHIFT_0x07fb": 948,
    "TIME_SHIFT_0x0848": 949,
    "TIME_SHIFT_0x0870": 950,
    "TIME_SHIFT_0x0898": 951,
    "TIME_SHIFT_0x08b6": 952,
    "TIME_SHIFT_0x08ca": 953,
    "TIME_SHIFT_0x08d9": 954,
    "TIME_SHIFT_0x0933": 955,
    "TIME_SHIFT_0x096a": 956,
    "TIME_SHIFT_0x0974": 957,
    "TIME_SHIFT_0x09b5": 958,
    "TIME_SHIFT_0x09ef": 959,
    "TIME_SHIFT_0x0a00": 960,
    "TIME_SHIFT_0x0a37": 961,
    "TIME_SHIFT_0x0a3c": 962,
    "TIME_SHIFT_0x0a4e": 963,
    "TIME_SHIFT_0x0a62": 964,
    "TIME_SHIFT_0x0a75": 965,
    "TIME_SHIFT_0x0a78": 966,
    "TIME_SHIFT_0x0ab6": 967,
    "TIME_SHIFT_0x0ae6": 968,
    "TIME_SHIFT_0x0afa": 969,
    "TIME_SHIFT_0x0b18": 970,
    "TIME_SHIFT_0x0b1a": 971,
    "TIME_SHIFT_0x0b3e": 972,
    "TIME_SHIFT_0x0b68": 973,
    "TIME_SHIFT_0x0b72": 974,
    "TIME_SHIFT_0x0b83": 975,
    "TIME_SHIFT_0x0bea": 976,
    "TIME_SHIFT_0x0c08": 977,
    "TIME_SHIFT_0x0c58": 978,
    "TIME_SHIFT_0x0c62": 979,
    "TIME_SHIFT_0x0c8a": 980,
    "TIME_SHIFT_0x0ca8": 981,
    "TIME_SHIFT_0x0ce4": 982,
    "TIME_SHIFT_0x0dca": 983,
    "TIME_SHIFT_0x0fdc": 984,
    "TIME_SHIFT_0x1568": 985,
    "TIME_SHIFT_0x1f68": 986,
    "TIME_SHIFT_0x208a": 987,
    "TIME_SHIFT_0x2d91": 988,
    "TIME_SHIFT_0x7d50": 989,
    "VELOCITY_0x0": 990,
    "VELOCITY_0x1": 991,
    "VELOCITY_0x2": 992,
    "VELOCITY_0x3": 993,
    "VELOCITY_0x4": 994,
    "VELOCITY_0x5": 995,
    "VELOCITY_0x6": 996,
    "VELOCITY_0x7": 997
  },
  "id2token": {
    "0": "<PAD>",
    "1": "<BOS>",
    "2": "<EOS>",
    "3": "<UNK>",
    "4": "<ROLE_MELODY>",
    "5": "<ROLE_BASS>",
    "6": "<ROLE_CHORDS>",
    "7": "<GENRE_CLASSICAL>",
    "8": "<GENRE_TRAP>",
    "9": "NOTE_OFF_0x0e",
    "10": "NOTE_OFF_0x11",
    "11": "NOTE_OFF_0x12",
    "12": "NOTE_OFF_0x13",
    "13": "NOTE_OFF_0x14",
    "14": "NOTE_OFF_0x15",
    "15": "NOTE_OFF_0x16",
    "16": "NOTE_OFF_0x17",
    "17": "NOTE_OFF_0x18",
    "18": "NOTE_OFF_0x19",
    "19": "NOTE_OFF_0x1a",
    "20": "NOTE_OFF_0x1b",
    "21": "NOTE_OFF_0x1c",
    "22": "NOTE_OFF_0x1d",
    "23": "NOTE_OFF_0x1e",
    "24": "NOTE_OFF_0x1f",
    "25": "NOTE_OFF_0x20",
    "26": "NOTE_OFF_0x21",
    "27": "NOTE_OFF_0x22",
    "28": "NOTE_OFF_0x23",
    "29": "NOTE_OFF_0x24",
    "30": "NOTE_OFF_0x25",
    "31": "NOTE_OFF_0x26",
    "32": "NOTE_OFF_0x27",
    "33": "NOTE_OFF_0x28",
    "34": "NOTE_OFF_0x29",
    "35": "NOTE_OFF_0x2a",
    "36": "NOTE_OFF_0x2b",
    "37": "NOTE_OFF_0x2c",
    "38": "NOTE_OFF_0x2d",
    "39": "NOTE_OFF_0x2e",
    "40": "NOTE_OFF_0x2f",
    "41": "NOTE_OFF_0x30",
    "42": "NOTE_OFF_0x31",
    "43": "NOTE_OFF_0x32",
    "44": "NOTE_OFF_0x33",
    "45": "NOTE_OFF_0x34",
    "46": "NOTE_OFF_0x35",
    "47": "NOTE_OFF_0x36",
    "48": "NOTE_OFF_0x37",
    "49": "NOTE_OFF_0x38",
    "50": "NOTE_OFF_0x39",
    "51": "NOTE_OFF_0x3a",
    "52": "NOTE_OFF_0x3b",
    "53": "NOTE_OFF_0x3c",
    "54": "NOTE_OFF_0x3d",
    "55": "NOTE_OFF_0x3e",
    "56": "NOTE_OFF_0x3f",
    "57": "NOTE_OFF_0x40",
    "58": "NOTE_OFF_0x41",
    "59": "NOTE_OFF_0x42",
    "60": "NOTE_OFF_0x43",
    "61": "NOTE_OFF_0x44",
    "62": "NOTE_OFF_0x45",
    "63": "NOTE_OFF_0x46",
    "64": "NOTE_OFF_0x47",
    "65": "NOTE_OFF_0x48",
    "66": "NOTE_OFF_0x49",
    "67": "NOTE_OFF_0x4a",
    "68": "NOTE_OFF_0x4b",
    "69": "NOTE_OFF_0x4c",
    "70": "NOTE_OFF_0x4d",
    "71": "NOTE_OFF_0x4e",
    "72": "NOTE_OFF_0x4f",
    "73": "NOTE_OFF_0x50",
    "74": "NOTE_OFF_0x51",
    "75": "NOTE_OFF_0x52",
    "76": "NOTE_OFF_0x53",
    "77": "NOTE_OFF_0x54",
    "78": "NOTE_OFF_0x55",
    "79": "NOTE_OFF_0x56",
    "80": "NOTE_OFF_0x57",
    "81": "NOTE_OFF_0x58",
    "82": "NOTE_OFF_0x59",
    "83": "NOTE_OFF_0x5a",
    "84": "NOTE_OFF_0x5b",
    "85": "NOTE_OFF_0x5c",
    "86": "NOTE_OFF_0x5d",
    "87": "NOTE_OFF_0x5e",
    "88": "NOTE_OFF_0x5f",
    "89": "NOTE_OFF_0x60",
    "90": "NOTE_OFF_0x61",
    "91": "NOTE_OFF_0x62",
    "92": "NOTE_OFF_0x63",
    "93": "NOTE_OFF_0x64",
    "94": "NOTE_OFF_0x65",
    "95": "NOTE_OFF_0x66",
    "96": "NOTE_OFF_0x67",
    "97": "NOTE_OFF_0x68",
    "98": "NOTE_OFF_0x69",
    "99": "NOTE_OFF_0x6a",
    "100": "NOTE_OFF_0x6b",
    "101": "NOTE_OFF_0x6c",
    "102": "NOTE_OFF_0x6d",
    "103": "NOTE_OFF_0x6e",
    "104": "NOTE_OFF_0x6f",
    "105": "NOTE_OFF_0x70",
    "106": "NOTE_OFF_0x71",
    "107": "NOTE_OFF_0x72",
    "108": "NOTE_OFF_0x73",
    "109": "NOTE_OFF_0x74",
    "110": "NOTE_OFF_0x76",
    "111": "NOTE_OFF_0x7f",
    "112": "NOTE_ON_0x0e",
    "113": "NOTE_ON_0x11",
    "114": "NOTE_ON_0x12",
    "115": "NOTE_ON_0x13",
    "116": "NOTE_ON_0x14",
    "117": "NOTE_ON_0x15",
    "118": "NOTE_ON_0x16",
    "119": "NOTE_ON_0x17",
    "120": "NOTE_ON_0x18",
    "121": "NOTE_ON_0x19",
    "122": "NOTE_ON_0x1a",
    "123": "NOTE_ON_0x1b",
    "124": "NOTE_ON_0x1c",
    "125": "NOTE_ON_0x1d",
    "126": "NOTE_ON_0x1e",
    "127": "NOTE_ON_0x1f",
    "128": "NOTE_ON_0x20",
    "129": "NOTE_ON_0x21",
    "130": "NOTE_ON_0x22",
    "131": "NOTE_ON_0x23",
    "132": "NOTE_ON_0x24",
    "133": "NOTE_ON_0x25",
    "134": "NOTE_ON_0x26",
    "135": "NOTE_ON_0x27",
    "136": "NOTE_ON_0x28",
    "137": "NOTE_ON_0x29",
    "138": "NOTE_ON_0x2a",
    "139": "NOTE_ON_0x2b",
    "140": "NOTE_ON_0x2c",
    "141": "NOTE_ON_0x2d",
    "142": "NOTE_ON_0x2e",
    "143": "NOTE_ON_0x2f",
    "144": "NOTE_ON_0x30",
    "145": "NOTE_ON_0x31",
    "146": "NOTE_ON_0x32",
    "147": "NOTE_ON_0x33",
    "148": "NOTE_ON_0x34",
    "149": "NOTE_ON_0x35",
    "150": "NOTE_ON_0x36",
    "151": "NOTE_ON_0x37",
    "152": "NOTE_ON_0x38",
    "153": "NOTE_ON_0x39",
    "154": "NOTE_ON_0x3a",
    "155": "NOTE_ON_0x3b",
    "156": "NOTE_ON_0x3c",
    "157": "NOTE_ON_0x3d",
    "158": "NOTE_ON_0x3e",
    "159": "NOTE_ON_0x3f",
    "160": "NOTE_ON_0x40",
    "161": "NOTE_ON_0x41",
    "162": "NOTE_ON_0x42",
    "163": "NOTE_ON_0x43",
    "164": "NOTE_ON_0x44",
    "165": "NOTE_ON_0x45",
    "166": "NOTE_ON_0x46",
    "167": "NOTE_ON_0x47",
    "168": "NOTE_ON_0x48",
    "169": "NOTE_ON_0x49",
    "170": "NOTE_ON_0x4a",
    "171": "NOTE_ON_0x4b",
    "172": "NOTE_ON_0x4c",
    "173": "NOTE_ON_0x4d",
    "174": "NOTE_ON_0x4e",
    "175": "NOTE_ON_0x4f",
    "176": "NOTE_ON_0x50",
    "177": "NOTE_ON_0x51",
    "178": "NOTE_ON_0x52",
    "179": "NOTE_ON_0x53",
    "180": "NOTE_ON_0x54",
    "181": "NOTE_ON_0x55",
    "182": "NOTE_ON_0x56",
    "183": "NOTE_ON_0x57",
    "184": "NOTE_ON_0x58",
    "185": "NOTE_ON_0x59",
    "186": "NOTE_ON_0x5a",
    "187": "NOTE_ON_0x5b",
    "188": "NOTE_ON_0x5c",
    "189": "NOTE_ON_0x5d",
    "190": "NOTE_ON_0x5e",
    "191": "NOTE_ON_0x5f",
    "192": "NOTE_ON_0x60",
    "193": "NOTE_ON_0x61",
    "194": "NOTE_ON_0x62",
    "195": "NOTE_ON_0x63",
    "196": "NOTE_ON_0x64",
    "197": "NOTE_ON_0x65",
    "198": "NOTE_ON_0x66",
    "199": "NOTE_ON_0x67",
    "200": "NOTE_ON_0x68",
    "201": "NOTE_ON_0x69",
    "202": "NOTE_ON_0x6a",
    "203": "NOTE_ON_0x6b",
    "204": "NOTE_ON_0x6c",
    "205": "NOTE_ON_0x6d",
    "206": "NOTE_ON_0x6e",
    "207": "NOTE_ON_0x6f",
    "208": "NOTE_ON_0x70",
    "209": "NOTE_ON_0x71",
    "210": "NOTE_ON_0x72",
    "211": "NOTE_ON_0x73",
    "212": "NOTE_ON_0x74",
    "213": "NOTE_ON_0x76",
    "214": "NOTE_ON_0x7f",
    "215": "TIME_SHIFT_0x0001",
    "216": "TIME_SHIFT_0x0002",
    "217": "TIME_SHIFT_0x0003",
    "218": "TIME_SHIFT_0x0005",
    "219": "TIME_SHIFT_0x0007",
    "220": "TIME_SHIFT_0x0008",
    "221": "TIME_SHIFT_0x000a",
    "222": "TIME_SHIFT_0x000c",
    "223": "TIME_SHIFT_0x000d",
    "224": "TIME_SHIFT_0x000f",
    "225": "TIME_SHIFT_0x0011",
    "226": "TIME_SHIFT_0x0012",
    "227": "TIME_SHIFT_0x0014",
    "228": "TIME_SHIFT_0x0016",
    "229": "TIME_SHIFT_0x0017",
    "230": "TIME_SHIFT_0x0019",
    "231": "TIME_SHIFT_0x001b",
    "232": "TIME_SHIFT_0x001c",
    "233": "TIME_SHIFT_0x001e",
    "234": "TIME_SHIFT_0x0020",
    "235": "TIME_SHIFT_0x0021",
    "236": "TIME_SHIFT_0x0023",
    "237": "TIME_SHIFT_0x0025",
    "238": "TIME_SHIFT_0x0026",
    "239": "TIME_SHIFT_0x0028",
    "240": "TIME_SHIFT_0x002a",
    "241": "TIME_SHIFT_0x002b",
    "242": "TIME_SHIFT_0x002d",
    "243": "TIME_SHIFT_0x002f",
    "244": "TIME_SHIFT_0x0030",
    "245": "TIME_SHIFT_0x0032",
    "246": "TIME_SHIFT_0x0034",
    "247": "TIME_SHIFT_0x0035",
    "248": "TIME_SHIFT_0x0037",
    "249": "TIME_SHIFT_0x0039",
    "250": "TIME_SHIFT_0x003a",
    "251": "TIME_SHIFT_0x003c",
    "252": "TIME_SHIFT_0x003e",
    "253": "TIME_SHIFT_0x003f",
    "254": "TIME_SHIFT_0x0041",
    "255": "TIME_SHIFT_0x0043",
    "256": "TIME_SHIFT_0x0044",
    "257": "TIME_SHIFT_0x0046",
    "258": "TIME_SHIFT_0x0048",
    "259": "TIME_SHIFT_0x0049",
    "260": "TIME_SHIFT_0x004b",
    "261": "TIME_SHIFT_0x004d",
    "262": "TIME_SHIFT_0x004e",
    "263": "TIME_SHIFT_0x0050",
    "264": "TIME_SHIFT_0x0052",
    "265": "TIME_SHIFT_0x0053",
    "266": "TIME_SHIFT_0x0055",
    "267": "TIME_SHIFT_0x0057",
    "268": "TIME_SHIFT_0x0058",
    "269": "TIME_SHIFT_0x005a",
    "270": "TIME_SHIFT_0x005c",
    "271": "TIME_SHIFT_0x005d",
    "272": "TIME_SHIFT_0x005f",
    "273": "TIME_SHIFT_0x0061",
    "274": "TIME_SHIFT_0x0062",
    "275": "TIME_SHIFT_0x0064",
    "276": "TIME_SHIFT_0x0066",
    "277": "TIME_SHIFT_0x0067",
    "278": "TIME_SHIFT_0x0069",
    "279": "TIME_SHIFT_0x006b",
    "280": "TIME_SHIFT_0x006c",
    "281": "TIME_SHIFT_0x006e",
    "282": "TIME_SHIFT_0x0070",
    "283": "TIME_SHIFT_0x0071",
    "284": "TIME_SHIFT_0x0073",
    "285": "TIME_SHIFT_0x0075",
    "286": "TIME_SHIFT_0x0076",
    "287": "TIME_SHIFT_0x0078",
    "288": "TIME_SHIFT_0x007a",
    "289": "TIME_SHIFT_0x007b",
    "290": "TIME_SHIFT_0x007d",
    "291": "TIME_SHIFT_0x007f",
    "292": "TIME_SHIFT_0x0080",
    "293": "TIME_SHIFT_0x0082",
    "294": "TIME_SHIFT_0x0084",
    "295": "TIME_SHIFT_0x0085",
    "296": "TIME_SHIFT_0x0087",
    "297": "TIME_SHIFT_0x0089",
    "298": "TIME_SHIFT_0x008a",
    "299": "TIME_SHIFT_0x008c",
    "300": "TIME_SHIFT_0x008e",
    "301": "TIME_SHIFT_0x008f",
    "302": "TIME_SHIFT_0x0091",
    "303": "TIME_SHIFT_0x0093",
    "304": "TIME_SHIFT_0x0094",
    "305": "TIME_SHIFT_0x0096",
    "306": "TIME_SHIFT_0x0098",
    "307": "TIME_SHIFT_0x0099",
    "308": "TIME_SHIFT_0x009b",
    "309": "TIME_SHIFT_0x009d",
    "310": "TIME_SHIFT_0x009e",
    "311": "TIME_SHIFT_0x00a0",
    "312": "TIME_SHIFT_0x00a2",
    "313": "TIME_SHIFT_0x00a3",
    "314": "TIME_SHIFT_0x00a5",
    "315": "TIME_SHIFT_0x00a7",
    "316": "TIME_SHIFT_0x00a8",
    "317": "TIME_SHIFT_0x00aa",
    "318": "TIME_SHIFT_0x00ac",
    "319": "TIME_SHIFT_0x00ad",
    "320": "TIME_SHIFT_0x00af",
    "321": "TIME_SHIFT_0x00b1",
    "322": "TIME_SHIFT_0x00b2",
    "323": "TIME_SHIFT_0x00b4",
    "324": "TIME_SHIFT_0x00b6",
    "325": "TIME_SHIFT_0x00b7",
    "326": "TIME_SHIFT_0x00b9",
    "327": "TIME_SHIFT_0x00bb",
    "328": "TIME_SHIFT_0x00bc",
    "329": "TIME_SHIFT_0x00be",
    "330": "TIME_SHIFT_0x00c0",
    "331": "TIME_SHIFT_0x00c1",
    "332": "TIME_SHIFT_0x00c3",
    "333": "TIME_SHIFT_0x00c5",
    "334": "TIME_SHIFT_0x00c6",
    "335": "TIME_SHIFT_0x00c8",
    "336": "TIME_SHIFT_0x00ca",
    "337": "TIME_SHIFT_0x00cb",
    "338": "TIME_SHIFT_0x00cd",
    "339": "TIME_SHIFT_0x00cf",
    "340": "TIME_SHIFT_0x00d0",
    "341": "TIME_SHIFT_0x00d2",
    "342": "TIME_SHIFT_0x00d4",
    "343": "TIME_SHIFT_0x00d5",
    "344": "TIME_SHIFT_0x00d7",
    "345": "TIME_SHIFT_0x00d9",
    "346": "TIME_SHIFT_0x00da",
    "347": "TIME_SHIFT_0x00dc",
    "348": "TIME_SHIFT_0x00de",
    "349": "TIME_SHIFT_0x00df",
    "350": "TIME_SHIFT_0x00e1",
    "351": "TIME_SHIFT_0x00e3",
    "352": "TIME_SHIFT_0x00e4",
    "353": "TIME_SHIFT_0x00e6",
    "354": "TIME_SHIFT_0x00e8",
    "355": "TIME_SHIFT_0x00e9",
    "356": "TIME_SHIFT_0x00eb",
    "357": "TIME_SHIFT_0x00ed",
    "358": "TIME_SHIFT_0x00ee",
    "359": "TIME_SHIFT_0x00f0",
    "360": "TIME_SHIFT_0x00f2",
    "361": "TIME_SHIFT_0x00f3",
    "362": "TIME_SHIFT_0x00f5",
    "363": "TIME_SHIFT_0x00f7",
    "364": "TIME_SHIFT_0x00f8",
    "365": "TIME_SHIFT_0x00fa",
    "366": "TIME_SHIFT_0x00fc",
    "367": "TIME_SHIFT_0x00fd",
    "368": "TIME_SHIFT_0x00ff",
    "369": "TIME_SHIFT_0x0101",
    "370": "TIME_SHIFT_0x0102",
    "371": "TIME_SHIFT_0x0104",
    "372": "TIME_SHIFT_0x0106",
    "373": "TIME_SHIFT_0x0107",
    "374": "TIME_SHIFT_0x0109",
    "375": "TIME_SHIFT_0x010b",
    "376": "TIME_SHIFT_0x010c",
    "377": "TIME_SHIFT_0x010e",
    "378": "TIME_SHIFT_0x0110",
    "379": "TIME_SHIFT_0x0111",
    "380": "TIME_SHIFT_0x0113",
    "381": "TIME_SHIFT_0x0115",
    "382": "TIME_SHIFT_0x0116",
    "383": "TIME_SHIFT_0x0118",
    "384": "TIME_SHIFT_0x011a",
    "385": "TIME_SHIFT_0x011b",
    "386": "TIME_SHIFT_0x011d",
    "387": "TIME_SHIFT_0x011f",
    "388": "TIME_SHIFT_0x0120",
    "389": "TIME_SHIFT_0x0122",
    "390": "TIME_SHIFT_0x0124",
    "391": "TIME_SHIFT_0x0125",
    "392": "TIME_SHIFT_0x0127",
    "393": "TIME_SHIFT_0x0129",
    "394": "TIME_SHIFT_0x012a",
    "395": "TIME_SHIFT_0x012c",
    "396": "TIME_SHIFT_0x012e",
    "397": "TIME_SHIFT_0x012f",
    "398": "TIME_SHIFT_0x0131",
    "399": "TIME_SHIFT_0x0133",
    "400": "TIME_SHIFT_0x0134",
    "401": "TIME_SHIFT_0x0136",
    "402": "TIME_SHIFT_0x0138",
    "403": "TIME_SHIFT_0x0139",
    "404": "TIME_SHIFT_0x013b",
    "405": "TIME_SHIFT_0x013d",
    "406": "TIME_SHIFT_0x013e",
    "407": "TIME_SHIFT_0x0140",
    "408": "TIME_SHIFT_0x0142",
    "409": "TIME_SHIFT_0x0143",
    "410": "TIME_SHIFT_0x0145",
    "411": "TIME_SHIFT_0x0147",
    "412": "TIME_SHIFT_0x0148",
    "413": "TIME_SHIFT_0x014a",
    "414": "TIME_SHIFT_0x014c",
    "415": "TIME_SHIFT_0x014d",
    "416": "TIME_SHIFT_0x014f",
    "417": "TIME_SHIFT_0x0151",
    "418": "TIME_SHIFT_0x0152",
    "419": "TIME_SHIFT_0x0154",
    "420": "TIME_SHIFT_0x0156",
    "421": "TIME_SHIFT_0x0157",
    "422": "TIME_SHIFT_0x0159",
    "423": "TIME_SHIFT_0x015b",
    "424": "TIME_SHIFT_0x015c",
    "425": "TIME_SHIFT_0x015e",
    "426": "TIME_SHIFT_0x0160",
    "427": "TIME_SHIFT_0x0161",
    "428": "TIME_SHIFT_0x0163",
    "429": "TIME_SHIFT_0x0165",
    "430": "TIME_SHIFT_0x0166",
    "431": "TIME_SHIFT_0x0168",
    "432": "TIME_SHIFT_0x016a",
    "433": "TIME_SHIFT_0x016b",
    "434": "TIME_SHIFT_0x016d",
    "435": "TIME_SHIFT_0x016f",
    "436": "TIME_SHIFT_0x0170",
    "437": "TIME_SHIFT_0x0172",
    "438": "TIME_SHIFT_0x0174",
    "439": "TIME_SHIFT_0x0175",
    "440": "TIME_SHIFT_0x0177",
    "441": "TIME_SHIFT_0x0179",
    "442": "TIME_SHIFT_0x017a",
    "443": "TIME_SHIFT_0x017c",
    "444": "TIME_SHIFT_0x017e",
    "445": "TIME_SHIFT_0x017f",
    "446": "TIME_SHIFT_0x0181",
    "447": "TIME_SHIFT_0x0183",
    "448": "TIME_SHIFT_0x0184",
    "449": "TIME_SHIFT_0x0186",
    "450": "TIME_SHIFT_0x0188",
    "451": "TIME_SHIFT_0x0189",
    "452": "TIME_SHIFT_0x018b",
    "453": "TIME_SHIFT_0x018d",
    "454": "TIME_SHIFT_0x018e",
    "455": "TIME_SHIFT_0x0190",
    "456": "TIME_SHIFT_0x0192",
    "457": "TIME_SHIFT_0x0193",
    "458": "TIME_SHIFT_0x0195",
    "459": "TIME_SHIFT_0x0197",
    "460": "TIME_SHIFT_0x0198",
    "461": "TIME_SHIFT_0x019a",
    "462": "TIME_SHIFT_0x019c",
    "463": "TIME_SHIFT_0x019d",
    "464": "TIME_SHIFT_0x019f",
    "465": "TIME_SHIFT_0x01a1",
    "466": "TIME_SHIFT_0x01a2",
    "467": "TIME_SHIFT_0x01a4",
    "468": "TIME_SHIFT_0x01a6",
    "469": "TIME_SHIFT_0x01a7",
    "470": "TIME_SHIFT_0x01a9",
    "471": "TIME_SHIFT_0x01ab",
    "472": "TIME_SHIFT_0x01ac",
    "473": "TIME_SHIFT_0x01ae",
    "474": "TIME_SHIFT_0x01b0",
    "475": "TIME_SHIFT_0x01b1",
    "476": "TIME_SHIFT_0x01b3",
    "477": "TIME_SHIFT_0x01b5",
    "478": "TIME_SHIFT_0x01b6",
    "479": "TIME_SHIFT_0x01b8",
    "480": "TIME_SHIFT_0x01ba",
    "481": "TIME_SHIFT_0x01bb",
    "482": "TIME_SHIFT_0x01bd",
    "483": "TIME_SHIFT_0x01bf",
    "484": "TIME_SHIFT_0x01c0",
    "485": "TIME_SHIFT_0x01c2",
    "486": "TIME_SHIFT_0x01c4",
    "487": "TIME_SHIFT_0x01c5",
    "488": "TIME_SHIFT_0x01c7",
    "489": "TIME_SHIFT_0x01c9",
    "490": "TIME_SHIFT_0x01ca",
    "491": "TIME_SHIFT_0x01cc",
    "492": "TIME_SHIFT_0x01ce",
    "493": "TIME_SHIFT_0x01cf",
    "494": "TIME_SHIFT_0x01d1",
    "495": "TIME_SHIFT_0x01d3",
    "496": "TIME_SHIFT_0x01d4",
    "497": "TIME_SHIFT_0x01d6",
    "498": "TIME_SHIFT_0x01d8",
    "499": "TIME_SHIFT_0x01d9",
    "500": "TIME_SHIFT_0x01db",
    "501": "TIME_SHIFT_0x01dd",
    "502": "TIME_SHIFT_0x01de",
    "503": "TIME_SHIFT_0x01e0",
    "504": "TIME_SHIFT_0x01e2",
    "505": "TIME_SHIFT_0x01e3",
    "506": "TIME_SHIFT_0x01e5",
    "507": "TIME_SHIFT_0x01e7",
    "508": "TIME_SHIFT_0x01e8",
    "509": "TIME_SHIFT_0x01ea",
    "510": "TIME_SHIFT_0x01ec",
    "511": "TIME_SHIFT_0x01ed",
    "512": "TIME_SHIFT_0x01ef",
    "513": "TIME_SHIFT_0x01f1",
    "514": "TIME_SHIFT_0x01f2",
    "515": "TIME_SHIFT_0x01f4",
    "516": "TIME_SHIFT_0x01f6",
    "517": "TIME_SHIFT_0x01f7",
    "518": "TIME_SHIFT_0x01f9",
    "519": "TIME_SHIFT_0x01fb",
    "520": "TIME_SHIFT_0x01fc",
    "521": "TIME_SHIFT_0x01fe",
    "522": "TIME_SHIFT_0x0200",
    "523": "TIME_SHIFT_0x0201",
    "524": "TIME_SHIFT_0x0203",
    "525": "TIME_SHIFT_0x0205",
    "526": "TIME_SHIFT_0x0206",
    "527": "TIME_SHIFT_0x0208",
    "528": "TIME_SHIFT_0x020a",
    "529": "TIME_SHIFT_0x020b",
    "530": "TIME_SHIFT_0x020d",
    "531": "TIME_SHIFT_0x020f",
    "532": "TIME_SHIFT_0x0210",
    "533": "TIME_SHIFT_0x0212",
    "534": "TIME_SHIFT_0x0214",
    "535": "TIME_SHIFT_0x0215",
    "536": "TIME_SHIFT_0x0217",
    "537": "TIME_SHIFT_0x0219",
    "538": "TIME_SHIFT_0x021a",
    "539": "TIME_SHIFT_0x021c",
    "540": "TIME_SHIFT_0x021e",
    "541": "TIME_SHIFT_0x021f",
    "542": "TIME_SHIFT_0x0221",
    "543": "TIME_SHIFT_0x0223",
    "544": "TIME_SHIFT_0x0224",
    "545": "TIME_SHIFT_0x0226",
    "546": "TIME_SHIFT_0x0228",
    "547": "TIME_SHIFT_0x0229",
    "548": "TIME_SHIFT_0x022b",
    "549": "TIME_SHIFT_0x022d",
    "550": "TIME_SHIFT_0x022e",
    "551": "TIME_SHIFT_0x0230",
    "552": "TIME_SHIFT_0x0232",
    "553": "TIME_SHIFT_0x0233",
    "554": "TIME_SHIFT_0x0235",
    "555": "TIME_SHIFT_0x0237",
    "556": "TIME_SHIFT_0x0238",
    "557": "TIME_SHIFT_0x023a",
    "558": "TIME_SHIFT_0x023c",
    "559": "TIME_SHIFT_0x023d",
    "560": "TIME_SHIFT_0x023f",
    "561": "TIME_SHIFT_0x0241",
    "562": "TIME_SHIFT_0x0242",
    "563": "TIME_SHIFT_0x0244",
    "564": "TIME_SHIFT_0x0246",
    "565": "TIME_SHIFT_0x0247",
    "566": "TIME_SHIFT_0x0249",
    "567": "TIME_SHIFT_0x024b",
    "568": "TIME_SHIFT_0x024c",
    "569": "TIME_SHIFT_0x024e",
    "570": "TIME_SHIFT_0x0250",
    "571": "TIME_SHIFT_0x0251",
    "572": "TIME_SHIFT_0x0253",
    "573": "TIME_SHIFT_0x0255",
    "574": "TIME_SHIFT_0x0256",
    "575": "TIME_SHIFT_0x0258",
    "576": "TIME_SHIFT_0x025a",
    "577": "TIME_SHIFT_0x025b",
    "578": "TIME_SHIFT_0x025d",
    "579": "TIME_SHIFT_0x025f",
    "580": "TIME_SHIFT_0x0260",
    "581": "TIME_SHIFT_0x0262",
    "582": "TIME_SHIFT_0x0264",
    "583": "TIME_SHIFT_0x0265",
    "584": "TIME_SHIFT_0x0267",
    "585": "TIME_SHIFT_0x0269",
    "586": "TIME_SHIFT_0x026a",
    "587": "TIME_SHIFT_0x026c",
    "588": "TIME_SHIFT_0x026e",
    "589": "TIME_SHIFT_0x026f",
    "590": "TIME_SHIFT_0x0271",
    "591": "TIME_SHIFT_0x0273",
    "592": "TIME_SHIFT_0x0274",
    "593": "TIME_SHIFT_0x0276",
    "594": "TIME_SHIFT_0x0278",
    "595": "TIME_SHIFT_0x0279",
    "596": "TIME_SHIFT_0x027b",
    "597": "TIME_SHIFT_0x027e",
    "598": "TIME_SHIFT_0x0280",
    "599": "TIME_SHIFT_0x0282",
    "600": "TIME_SHIFT_0x0283",
    "601": "TIME_SHIFT_0x0285",
    "602": "TIME_SHIFT_0x0287",
    "603": "TIME_SHIFT_0x0288",
    "604": "TIME_SHIFT_0x028a",
    "605": "TIME_SHIFT_0x028c",
    "606": "TIME_SHIFT_0x028d",
    "607": "TIME_SHIFT_0x028f",
    "608": "TIME_SHIFT_0x0291",
    "609": "TIME_SHIFT_0x0292",
    "610": "TIME_SHIFT_0x0294",
    "611": "TIME_SHIFT_0x0296",
    "612": "TIME_SHIFT_0x0297",
    "613": "TIME_SHIFT_0x0299",
    "614": "TIME_SHIFT_0x029b",
    "615": "TIME_SHIFT_0x029c",
    "616": "TIME_SHIFT_0x029e",
    "617": "TIME_SHIFT_0x02a0",
    "618": "TIME_SHIFT_0x02a1",
    "619": "TIME_SHIFT_0x02a3",
    "620": "TIME_SHIFT_0x02a5",
    "621": "TIME_SHIFT_0x02a6",
    "622": "TIME_SHIFT_0x02a8",
    "623": "TIME_SHIFT_0x02aa",
    "624": "TIME_SHIFT_0x02ab",
    "625": "TIME_SHIFT_0x02ad",
    "626": "TIME_SHIFT_0x02af",
    "627": "TIME_SHIFT_0x02b0",
    "628": "TIME_SHIFT_0x02b2",
    "629": "TIME_SHIFT_0x02b4",
    "630": "TIME_SHIFT_0x02b5",
    "631": "TIME_SHIFT_0x02b7",
    "632": "TIME_SHIFT_0x02b9",
    "633": "TIME_SHIFT_0x02ba",
    "634": "TIME_SHIFT_0x02bc",
    "635": "TIME_SHIFT_0x02be",
    "636": "TIME_SHIFT_0x02bf",
    "637": "TIME_SHIFT_0x02c1",
    "638": "TIME_SHIFT_0x02c3",
    "639": "TIME_SHIFT_0x02c4",
    "640": "TIME_SHIFT_0x02c6",
    "641": "TIME_SHIFT_0x02c9",
    "642": "TIME_SHIFT_0x02cb",
    "643": "TIME_SHIFT_0x02cd",
    "644": "TIME_SHIFT_0x02ce",
    "645": "TIME_SHIFT_0x02d0",
    "646": "TIME_SHIFT_0x02d2",
    "647": "TIME_SHIFT_0x02d3",
    "648": "TIME_SHIFT_0x02d5",
    "649": "TIME_SHIFT_0x02d7",
    "650": "TIME_SHIFT_0x02d8",
    "651": "TIME_SHIFT_0x02da",
    "652": "TIME_SHIFT_0x02dc",
    "653": "TIME_SHIFT_0x02dd",
    "654": "TIME_SHIFT_0x02df",
    "655": "TIME_SHIFT_0x02e2",
    "656": "TIME_SHIFT_0x02e4",
    "657": "TIME_SHIFT_0x02e6",
    "658": "TIME_SHIFT_0x02e7",
    "659": "TIME_SHIFT_0x02e9",
    "660": "TIME_SHIFT_0x02eb",
    "661": "TIME_SHIFT_0x02ec",
    "662": "TIME_SHIFT_0x02ee",
    "663": "TIME_SHIFT_0x02f1",
    "664": "TIME_SHIFT_0x02f3",
    "665": "TIME_SHIFT_0x02f5",
    "666": "TIME_SHIFT_0x02f6",
    "667": "TIME_SHIFT_0x02f8",
    "668": "TIME_SHIFT_0x02fa",
    "669": "TIME_SHIFT_0x02fb",
    "670": "TIME_SHIFT_0x02fd",
    "671": "TIME_SHIFT_0x0300",
    "672": "TIME_SHIFT_0x0302",
    "673": "TIME_SHIFT_0x0304",
    "674": "TIME_SHIFT_0x0305",
    "675": "TIME_SHIFT_0x0307",
    "676": "TIME_SHIFT_0x0309",
    "677": "TIME_SHIFT_0x030a",
    "678": "TIME_SHIFT_0x030c",
    "679": "TIME_SHIFT_0x030e",
    "680": "TIME_SHIFT_0x030f",
    "681": "TIME_SHIFT_0x0311",
    "682": "TIME_SHIFT_0x0313",
    "683": "TIME_SHIFT_0x0314",
    "684": "TIME_SHIFT_0x0316",
    "685": "TIME_SHIFT_0x0318",
    "686": "TIME_SHIFT_0x0319",
    "687": "TIME_SHIFT_0x031b",
    "688": "TIME_SHIFT_0x031e",
    "689": "TIME_SHIFT_0x0320",
    "690": "TIME_SHIFT_0x0323",
    "691": "TIME_SHIFT_0x0325",
    "692": "TIME_SHIFT_0x0327",
    "693": "TIME_SHIFT_0x032a",
    "694": "TIME_SHIFT_0x032c",
